import Vue from 'vue'
import Vuex from 'vuex'
import actions from './actions'
import getters from './getters'
import mutations from './mutations'

Vue.use(Vuex)

export const store = new Vuex.Store({
  state: {
    isLoaded: false,
    products: [
      {
        name: 'EMS-1',
        slug: 'ems-1',
        img: '../../static/img/ems-1.png',
        color: '#321101',
        textcolor: '#f8f8ff',
        text: 'Електронний мінометний приціл EMS-1',
        textblock: {
          title: 'Інформація',
          textBig: 'Електронний мінометний приціл EMS-1 призначений для стрільби з відкритих вогневих позицій. Приціл розроблено для використання з мінометами калібру до 82мм включно, як вітчизняного так і закордонного виробництва. Приціл програмується під будь-які типи мінометів та боєприпасів. В одному прицілі можуть зберігатись профілі налаштувань для різних типів мінометів та боєприпасів.',
          textColumn1: '<p>Як відомо, для здійснення мінометного пострілу з відкритої вогневої позиції необхідно точно встановити кут піднесення міномету, одночасно контролюючи кути завалу ствола, та навести міномет на ціль. Це потребує навичок та забирає багато часу.</p><p>Але сучасна електроніка дозволяє швидко і точно виконати цю задачу.</p>',
          textColumn2: '<p>Окрім цього, від навідника не вимагається особливої підготовки та використання таблиць стрільби.</p><p>Електронний мінометний приціл надзвичайно простий у використанні – має числову індикацію дальності польоту міни в метрах та шкалу індикації завалу ствола.</p>',
          textFull: '<strong>Використання прицілу EMS-1 надає такі переваги:</strong><p>у підготовці особового складу:</p><ul> <li>знижуються кваліфікаційні вимоги до розрахунку міномету, внаслідок чого зменшуються,</li><li>витрати часу на бойову підготовку.</li></ul><p>Безпосередньо під час ведення бойових дій:</p><ul><li>скорочується час на відкриття вогню;</li><li>зменшується час перебування особового складу на бойовій позиції;</li><li>мінімізується ймовірність помилки при пострілі;</li><li>компактність, мала вага та ергономічність прицілу.</li></ul><br><strong>Додаткові функції:</strong><ul> <li>автоматичне обчислення та врахування поправок істинної висоти цілі;</li><li>автоматичне регулювання яскравості індикації залежно від освітлення;</li><li>можливість зміни/оновлення програмного забезпечення прицілу;</li><li>можливість модифікації для автоматичного обчислення та врахування поправок на атмосферні умови.</li></ul><br><strong>Технічні характеристики:</strong><ul> <li>лінійні розміри: 74х66х60 мм</li><li>маса: 235 гр.</li><li>тривалість роботи від одного елемента живлення:</li><li>- у режимі очікування: &gt;1 року</li><li>- у режимі індикації: від 10 до 50 годин</li><li>живлення: CR123A літієва батарея або 16340 Li-Ion акумулятор</li><li>температурний режим: -40°…+60 °С</li><li>ударна стійкість: &gt;65g</li><li>тип захисту: IP64</li><li>похибки визначення кутів: &lt;0,1° (&lt;0-02)</li></ul>'
        }
      },
      {
        name: 'USMS-1',
        slug: 'usms-1',
        img: '../../static/img/usms-1.png',
        color: '#272d15',
        textcolor: '#f8f8ff',
        text: 'Ультразвукова метеостанція USMS-1',
        textblock: {
          title: 'Інформація',
          textBig: 'Електронний мінометний приціл EMS-1 призначений для стрільби з відкритих вогневих позицій. Приціл розроблено для використання з мінометами калібру до 82мм включно, як вітчизняного так і закордонного виробництва. Приціл програмується під будь-які типи мінометів та боєприпасів. В одному прицілі можуть зберігатись профілі налаштувань для різних типів мінометів та боєприпасів.',
          textColumn1: '<p>Як відомо, для здійснення мінометного пострілу з відкритої вогневої позиції необхідно точно встановити кут піднесення міномету, одночасно контролюючи кути завалу ствола, та навести міномет на ціль. Це потребує навичок та забирає багато часу.</p><p>Але сучасна електроніка дозволяє швидко і точно виконати цю задачу.</p>',
          textColumn2: '<p>Окрім цього, від навідника не вимагається особливої підготовки та використання таблиць стрільби.</p><p>Електронний мінометний приціл надзвичайно простий у використанні – має числову індикацію дальності польоту міни в метрах та шкалу індикації завалу ствола.</p>',
          textFull: '<strong>Використання прицілу EMS-1 надає такі переваги:</strong><p>у підготовці особового складу:</p><ul> <li>знижуються кваліфікаційні вимоги до розрахунку міномету, внаслідок чого зменшуються,</li><li>витрати часу на бойову підготовку.</li></ul><p>Безпосередньо під час ведення бойових дій:</p><ul><li>скорочується час на відкриття вогню;</li><li>зменшується час перебування особового складу на бойовій позиції;</li><li>мінімізується ймовірність помилки при пострілі;</li><li>компактність, мала вага та ергономічність прицілу.</li></ul><br><strong>Додаткові функції:</strong><ul> <li>автоматичне обчислення та врахування поправок істинної висоти цілі;</li><li>автоматичне регулювання яскравості індикації залежно від освітлення;</li><li>можливість зміни/оновлення програмного забезпечення прицілу;</li><li>можливість модифікації для автоматичного обчислення та врахування поправок на атмосферні умови.</li></ul><br><strong>Технічні характеристики:</strong><ul> <li>лінійні розміри: 74х66х60 мм</li><li>маса: 235 гр.</li><li>тривалість роботи від одного елемента живлення:</li><li>- у режимі очікування: &gt;1 року</li><li>- у режимі індикації: від 10 до 50 годин</li><li>живлення: CR123A літієва батарея або 16340 Li-Ion акумулятор</li><li>температурний режим: -40°…+60 °С</li><li>ударна стійкість: &gt;65g</li><li>тип захисту: IP64</li><li>похибки визначення кутів: &lt;0,1° (&lt;0-02)</li></ul>'
        }
      },
      {
        name: 'PARS-1',
        slug: 'pars-1',
        img: '../../static/img/pars-1.png',
        color: '#0c504a',
        textcolor: '#f8f8ff',
        text: 'Програмне забезпечення «Балістичний обчислювач PARS-1»',
        textblock: {
          title: 'Інформація',
          textBig: 'Електронний мінометний приціл EMS-1 призначений для стрільби з відкритих вогневих позицій. Приціл розроблено для використання з мінометами калібру до 82мм включно, як вітчизняного так і закордонного виробництва. Приціл програмується під будь-які типи мінометів та боєприпасів. В одному прицілі можуть зберігатись профілі налаштувань для різних типів мінометів та боєприпасів.',
          textColumn1: '<p>Як відомо, для здійснення мінометного пострілу з відкритої вогневої позиції необхідно точно встановити кут піднесення міномету, одночасно контролюючи кути завалу ствола, та навести міномет на ціль. Це потребує навичок та забирає багато часу.</p><p>Але сучасна електроніка дозволяє швидко і точно виконати цю задачу.</p>',
          textColumn2: '<p>Окрім цього, від навідника не вимагається особливої підготовки та використання таблиць стрільби.</p><p>Електронний мінометний приціл надзвичайно простий у використанні – має числову індикацію дальності польоту міни в метрах та шкалу індикації завалу ствола.</p>',
          textFull: '<strong>Використання прицілу EMS-1 надає такі переваги:</strong><p>у підготовці особового складу:</p><ul> <li>знижуються кваліфікаційні вимоги до розрахунку міномету, внаслідок чого зменшуються,</li><li>витрати часу на бойову підготовку.</li></ul><p>Безпосередньо під час ведення бойових дій:</p><ul><li>скорочується час на відкриття вогню;</li><li>зменшується час перебування особового складу на бойовій позиції;</li><li>мінімізується ймовірність помилки при пострілі;</li><li>компактність, мала вага та ергономічність прицілу.</li></ul><br><strong>Додаткові функції:</strong><ul> <li>автоматичне обчислення та врахування поправок істинної висоти цілі;</li><li>автоматичне регулювання яскравості індикації залежно від освітлення;</li><li>можливість зміни/оновлення програмного забезпечення прицілу;</li><li>можливість модифікації для автоматичного обчислення та врахування поправок на атмосферні умови.</li></ul><br><strong>Технічні характеристики:</strong><ul> <li>лінійні розміри: 74х66х60 мм</li><li>маса: 235 гр.</li><li>тривалість роботи від одного елемента живлення:</li><li>- у режимі очікування: &gt;1 року</li><li>- у режимі індикації: від 10 до 50 годин</li><li>живлення: CR123A літієва батарея або 16340 Li-Ion акумулятор</li><li>температурний режим: -40°…+60 °С</li><li>ударна стійкість: &gt;65g</li><li>тип захисту: IP64</li><li>похибки визначення кутів: &lt;0,1° (&lt;0-02)</li></ul>'
        }
      },
      {
        name: 'LGM-1/120',
        slug: 'lgm-1-120',
        img: '../../static/img/lgm-1-120.png',
        color: '#c79f0e',
        textcolor: '#f8f8ff',
        text: 'Пристрій контролю геометричних параметрів каналу ствола LGM-1/120',
        textblock: {
          title: 'Інформація',
          textBig: 'Електронний мінометний приціл EMS-1 призначений для стрільби з відкритих вогневих позицій. Приціл розроблено для використання з мінометами калібру до 82мм включно, як вітчизняного так і закордонного виробництва. Приціл програмується під будь-які типи мінометів та боєприпасів. В одному прицілі можуть зберігатись профілі налаштувань для різних типів мінометів та боєприпасів.',
          textColumn1: '<p>Як відомо, для здійснення мінометного пострілу з відкритої вогневої позиції необхідно точно встановити кут піднесення міномету, одночасно контролюючи кути завалу ствола, та навести міномет на ціль. Це потребує навичок та забирає багато часу.</p><p>Але сучасна електроніка дозволяє швидко і точно виконати цю задачу.</p>',
          textColumn2: '<p>Окрім цього, від навідника не вимагається особливої підготовки та використання таблиць стрільби.</p><p>Електронний мінометний приціл надзвичайно простий у використанні – має числову індикацію дальності польоту міни в метрах та шкалу індикації завалу ствола.</p>',
          textFull: '<strong>Використання прицілу EMS-1 надає такі переваги:</strong><p>у підготовці особового складу:</p><ul> <li>знижуються кваліфікаційні вимоги до розрахунку міномету, внаслідок чого зменшуються,</li><li>витрати часу на бойову підготовку.</li></ul><p>Безпосередньо під час ведення бойових дій:</p><ul><li>скорочується час на відкриття вогню;</li><li>зменшується час перебування особового складу на бойовій позиції;</li><li>мінімізується ймовірність помилки при пострілі;</li><li>компактність, мала вага та ергономічність прицілу.</li></ul><br><strong>Додаткові функції:</strong><ul> <li>автоматичне обчислення та врахування поправок істинної висоти цілі;</li><li>автоматичне регулювання яскравості індикації залежно від освітлення;</li><li>можливість зміни/оновлення програмного забезпечення прицілу;</li><li>можливість модифікації для автоматичного обчислення та врахування поправок на атмосферні умови.</li></ul><br><strong>Технічні характеристики:</strong><ul> <li>лінійні розміри: 74х66х60 мм</li><li>маса: 235 гр.</li><li>тривалість роботи від одного елемента живлення:</li><li>- у режимі очікування: &gt;1 року</li><li>- у режимі індикації: від 10 до 50 годин</li><li>живлення: CR123A літієва батарея або 16340 Li-Ion акумулятор</li><li>температурний режим: -40°…+60 °С</li><li>ударна стійкість: &gt;65g</li><li>тип захисту: IP64</li><li>похибки визначення кутів: &lt;0,1° (&lt;0-02)</li></ul>'
        }
      }
    ],
    pages: [
      {
        name: 'Про нас',
        slug: 'about',
        img: '../../static/img/skybg.jpg',
        colorText: '#000000',
        colorBg: '#ffffff',
        textblock: {
          title: 'Хто ми є',
          textBig: 'A common denominator for all investments across the various industries is that the companies are adding brand and technological edge to the market, innovation and disruption in addition to including sustainable elements and a general ethical awareness.',
          textColumn1: '<p>A common denominator for all investments across the various industries is that the companies are adding brand and technological edge to the market, innovation and disruption in addition to including sustainable elements and a general ethical awareness.</p>',
          textColumn2: '<p>A common denominator for all investments across the various industries is that the companies are adding brand and technological edge to the market, innovation and disruption in addition to including sustainable elements and a general ethical awareness.</p>'
        },
        photos: [
          '../../static/img/about-1.jpg',
          '../../static/img/about-2.jpg',
          '../../static/img/about-3.jpg'
        ]
      },
      {
        name: 'Контакти',
        slug: 'contact',
        img: '../../static/img/skybg.jpg',
        colorText: '#000000',
        colorBg: '#ffffff',
        textblock: {
          title: 'Способи зв\'язку',
          textBig: 'ООО «НВФ «ПАРС»',
          textColumn1: '<p>+38 (093) 889 83 80</p><p>+38 (096) 047 73 23</p>',
          textColumn2: '<p>Пропозиції надсилайте за адресою:</p><p><a href="mailto:basil2k2k@gmail.com">basil2k2k@gmail.com</a></p>'
        }
      }
    ]
  },
  getters,
  mutations,
  actions
})
